[
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"PLA Unit 61398 (Chinese: 61398部队, Pinyin: 61398 bùduì) is the Military Unit Cover Designator (MUCD)[1] of a People's Liberation Army advanced persistent threat unit that has been alleged to be a source of Chinese computer hacking attacks.",
       "synonyms":[
          "Comment Panda",
          "PLA Unit 61398",
          "APT 1",
          "APT1",
          "Advanced Persistent Threat 1",
          "Byzantine Candor",
          "Group 3",
          "TG-8223",
          "Comment Group",
          "Brown Fox",
          "GIF89a",
          "ShadyRAT",
          "Shanghai Group"
       ],
       "link":"https://attack.mitre.org/groups/G0006/",
       "targets":[
          "United States",
          "Taiwan",
          "Israel",
          "Norway",
          "United Arab Emirates",
          "United Kingdom",
          "Singapore",
          "India",
          "Belgium",
          "South Africa",
          "Switzerland",
          "Canada",
          "France",
          "Luxembourg",
          "Japan"
       ],
       "name":"Comment Crew"
    },
    {
       "link":"https://wikileaks.org/vault7/document/2015-08-20150814-256-CSIR-15005-Stalker-Panda/2015-08-20150814-256-CSIR-15005-Stalker-Panda.pdf",
       "attribution":"China",
       "description":"The group appears to have close ties to the Chinese National University of Defense and Technology, which is possibly linked to the PLA. Stalker Panda has been observed conducting targeted attacks against Japan, Taiwan, Hong Kong, and the United States. The attacks appear to be centered on political, media, and engineering sectors. The group appears to have been active since around 2010 and they maintain and upgrade their tools regularly.",
       "name":"Stalker Panda"
    },
    {
       "attribution":"China",
       "description":"These attackers were the subject of an extensive report by Symantec in 2011, which termed the attackers Nitro and stated: 'The goal of the attackers appears to be to collect intellectual property such as design documents, formulas, and manufacturing processes. In addition, the same attackers appear to have a lengthy operation history including attacks on other industries and organizations. Attacks on the chemical industry are merely their latest attack wave. As part of our investigations, we were also able to identify and contact one of the attackers to try and gain insights into the motivations behind these attacks.' Palo Alto Networks reported on continued activity by the attackers in 2014. ",
       "synonyms":[
          "Covert Grove"
       ],
       "link":"http://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/the_nitro_attacks.pdf",
       "name":"Nitro"
    },
    {
       "attribution":"China",
       "description":"The New York Times described Codoso as: 'A collection of hackers for hire that the security industry has been tracking for years. Over the years, the group has breached banks, law firms and tech companies, and once hijacked the Forbes website to try to infect visitors’ computers with malware.'",
       "synonyms":[
          "C0d0so",
          "APT19",
          "APT 19",
          "Sunshop Group"
       ],
       "link":"https://www.proofpoint.com/us/exploring-bergard-old-malware-new-tricks",
       "name":"Codoso"
    },
    {
       "link":"http://www.rsaconference.com/writable/presentations/file_upload/anf-t07b-the-art-of-attribution-identifying-and-pursuing-your-cyber-adversaries_final.pdf",
       "attribution":"China",
       "description":"Adversary targeting dissident groups in China and its surroundings.",
       "name":"Karma Panda"
    },
    {
       "link":"https://files.sans.org/summit/Threat_Hunting_Incident_Response_Summit_2016/PDFs/Detecting-and-Responding-to-Pandas-and-Bears-Christopher-Scott-CrowdStrike-and-Wendi-Whitmore-IBM.pdf",
       "attribution":"China",
       "description":"Adversary group targeting telecommunication and technology organizations.",
       "name":"Foxy Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Putter Panda were the subject of an extensive report by CrowdStrike, which stated: 'The CrowdStrike Intelligence team has been tracking this particular unit since2012, under the codename PUTTER PANDA, and has documented activity dating back to 2007. The report identifies Chen Ping, aka cpyy, and the primary location of Unit 61486.'",
       "synonyms":[
          "PLA Unit 61486",
          "APT 2",
          "APT2",
          "Group 36",
          "APT-2",
          "MSUpdater",
          "4HCrew",
          "SULPHUR",
          "SearchFire",
          "TG-6952"
       ],
       "link":"https://attack.mitre.org/groups/G0024/",
       "targets":[
          "U.S. satellite and aerospace sector"
       ],
       "name":"Putter Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Symantec described UPS in  2016 report as: 'Buckeye (also known as APT3, Gothic Panda, UPS Team, and TG-0110) is a cyberespionage group that is believed to have been operating for well over half a decade. Traditionally, the group attacked organizations in the US as well as other targets. However, Buckeyes focus appears to have changed as of June 2015, when the group began compromising political entities in Hong Kong.'",
       "synonyms":[
          "Gothic Panda",
          "TG-0110",
          "APT 3",
          "Group 6",
          "UPS Team",
          "APT3",
          "Buckeye",
          "Boyusec"
       ],
       "link":"https://www.fireeye.com/blog/threat-research/2015/06/operation-clandestine-wolf-adobe-flash-zero-day.html",
       "targets":[
          "United States",
          "United Kingdom",
          "Hong Kong"
       ],
       "name":"UPS"
    },
    {
       "motivation":"espionage",
       "attribution":"South Korea",
       "description":"Kaspersky described DarkHotel in a 2014 report as: '... DarkHotel drives its campaigns by spear-phishing targets with highly advanced Flash zero-day exploits that effectively evade the latest Windows and Adobe defenses, and yet they also imprecisely spread among large numbers of vague targets with peer-to-peer spreading tactics. Moreover, this crews most unusual characteristic is that for several years the Darkhotel APT has maintained a capability to use hotel networks to follow and hit selected targets as they travel around the world.'",
       "synonyms":[
          "DUBNIUM",
          "Fallout Team",
          "Karba",
          "Luder",
          "Nemim",
          "Nemin",
          "Tapaoux",
          "Pioneer",
          "Shadow Crane",
          "APT-C-06",
          "SIG25"
       ],
       "link":"https://attack.mitre.org/groups/G0012/",
       "targets":[
          "Japan",
          "Russia",
          "Taiwan",
          "South Korea",
          "China"
       ],
       "name":"DarkHotel"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"A group of China-based attackers, who conducted a number of spear phishing attacks in 2013.",
       "synonyms":[
          "Numbered Panda",
          "TG-2754",
          "BeeBus",
          "Group 22",
          "DynCalc",
          "Calc Team",
          "DNSCalc",
          "Crimson Iron",
          "APT12",
          "APT 12"
       ],
       "link":"http://www.crowdstrike.com/blog/whois-numbered-panda/",
       "targets":[
          "Taiwan",
          "Japan"
       ],
       "name":"IXESHE"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Between November 26, 2015, and December 1, 2015, known and suspected China-based APT groups launched several spear-phishing attacks targeting Japanese and Taiwanese organizations in the high-tech, government services, media and financial services industries. Each campaign delivered a malicious Microsoft Word document exploiting the aforementioned EPS dict copy use-after-free vulnerability, and the local Windows privilege escalation vulnerability CVE-2015-1701. The successful exploitation of both vulnerabilities led to the delivery of either a downloader that we refer to as IRONHALO, or a backdoor that we refer to as ELMER.",
       "synonyms":[
          "APT16",
          "SVCMONDR"
       ],
       "link":"https://www.fireeye.com/blog/threat-research/2015/12/the_eps_awakens.html",
       "targets":[
          "Japan",
          "Taiwan"
       ],
       "name":"APT 16"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"FireEye described APT17 in a 2015 report as: 'APT17, also known as DeputyDog, is a China based threat group that FireEye Intelligence has observed conducting network intrusions against U.S. government entities, the defense industry, law firms, information technology companies, mining companies, and non-government organizations.'",
       "synonyms":[
          "APT 17",
          "Deputy Dog",
          "Group 8",
          "APT17",
          "Hidden Lynx",
          "Tailgater Team",
          "Dogfish"
       ],
       "link":"http://www.fireeye.com/blog/technical/cyber-exploits/2013/09/operation-deputydog-zero-day-cve-2013-3893-attack-against-japanese-targets.html",
       "targets":[
          "United States"
       ],
       "name":"Aurora Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Wekby was described by Palo Alto Networks in a 2015 report as: 'Wekby is a group that has been active for a number of years, targeting various industries such as healthcare, telecommunications, aerospace, defense, and high tech. The group is known to leverage recently released exploits very shortly after those exploits are available, such as in the case of HackingTeams Flash zero - day exploit.'",
       "synonyms":[
          "Dynamite Panda",
          "TG-0416",
          "APT 18",
          "SCANDIUM",
          "PLA Navy",
          "APT18"
       ],
       "link":"https://threatpost.com/apt-gang-branches-out-to-medical-espionage-in-community-health-breach/107828",
       "targets":[
          "United States"
       ],
       "name":"Wekby"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"The Winnti grouping of activity is large and may actually be a number of linked groups rather than a single discrete entity. Kaspersky describe Winnti as: 'The Winnti group has been attacking companies in the online video game industry since 2009 and is currently still active. The groups objectives are stealing digital certificates signed by legitimate software vendors in addition to intellectual property theft, including the source code of online game projects. The majority of the victims are from South East Asia.'",
       "synonyms":[
          "Winnti Umbrella",
          "Winnti Group",
          "WinNTI",
          "Tailgater Team",
          "Suckfly",
          "APT41",
          "APT 41",
          "Group 72",
          "Group72",
          "Tailgater",
          "Ragebeast",
          "Blackfly",
          "Lead",
          "Wicked Spider",
          "APT17",
          "APT 17",
          "Dogfish",
          "Deputy Dog",
          "Wicked Panda",
          "Barium"
       ],
       "link":"https://attack.mitre.org/groups/G0044/",
       "targets":[
          "United States",
          "Netherlands",
          "Italy",
          "Japan",
          "United Kingdom",
          "Belgium",
          "Russia",
          "Indonesia",
          "Germany",
          "Switzerland",
          "China"
       ],
       "name":"Axiom"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Adversary group targeting financial, technology, non-profit organisations.",
       "synonyms":[
          "Deep Panda",
          "WebMasters",
          "APT 19",
          "KungFu Kittens",
          "Black Vine",
          "Group 13",
          "PinkPanther",
          "Sh3llCr3w"
       ],
       "link":"https://attack.mitre.org/groups/G0009/",
       "targets":[
          "United States"
       ],
       "name":"Shell Crew"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Kaspersky described Naikon in a 2015 report as: 'The Naikon group is mostly active in countries such as the Philippines, Malaysia, Cambodia, Indonesia, Vietnam, Myanmar, Singapore, and Nepal, hitting a variety of targets in a very opportunistic way.'",
       "synonyms":[
          "PLA Unit 78020",
          "APT 30",
          "APT30",
          "Override Panda",
          "Camerashy",
          "APT.Naikon",
          "Lotus Panda",
          "Hellsing"
       ],
       "link":"https://attack.mitre.org/groups/G0019/",
       "targets":[
          "India",
          "Saudi Arabia",
          "Vietnam",
          "Myanmar",
          "Singapore",
          "Thailand",
          "Malaysia",
          "Cambodia",
          "China",
          "Philippines",
          "South Korea",
          "United States",
          "Indonesia",
          "Laos"
       ],
       "name":"Naikon"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Lotus Blossom is a threat group that has targeted government and military organizations in Southeast Asia.",
       "synonyms":[
          "Spring Dragon",
          "ST Group",
          "Esile",
          "DRAGONFISH"
       ],
       "link":"https://attack.mitre.org/groups/G0030/",
       "targets":[
          "Japan",
          "Philippines",
          "Hong Kong",
          "Indonesia",
          "Taiwan",
          "Vietnam"
       ],
       "name":"Lotus Blossom"
    },
    {
       "attribution":"China",
       "description":"We have investigated their intrusions since 2013 and have been battling them nonstop over the last year at several large telecommunications and technology companies. The determination of this China-based adversary is truly impressive: they are like a dog with a bone.\nHURRICANE PANDA’s preferred initial vector of compromise and persistence is a China Chopper webshell – a tiny and easily obfuscated 70 byte text file that consists of an ‘eval()’ command, which is then used to provide full command execution and file upload/download capabilities to the attackers. This script is typically uploaded to a web server via a SQL injection or WebDAV vulnerability, which is often trivial to uncover in a company with a large external web presence.\nOnce inside, the adversary immediately moves on to execution of a credential theft tool such as Mimikatz (repacked to avoid AV detection). If they are lucky to have caught an administrator who might be logged into that web server at the time, they will have gained domain administrator credentials and can now roam your network at will via ‘net use’ and ‘wmic’ commands executed through the webshell terminal.",
       "synonyms":[
          "Black Vine",
          "TEMP.Avengers",
          "Zirconium",
          "APT 31",
          "APT31"
       ],
       "link":"http://www.crowdstrike.com/blog/cyber-deterrence-in-action-a-story-of-one-long-hurricane-panda-campaign/",
       "name":"Hurricane Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"A China-based actor that targets foreign embassies to collect data on government, defence, and technology sectors.",
       "synonyms":[
          "TG-3390",
          "APT 27",
          "TEMP.Hippo",
          "Group 35",
          "Bronze Union",
          "ZipToken",
          "HIPPOTeam",
          "APT27",
          "Operation Iron Tiger",
          "Iron Tiger APT",
          "BRONZE UNION",
          "Lucky Mouse"
       ],
       "link":"http://www.secureworks.com/cyber-threat-intelligence/threats/threat-group-3390-targets-organizations-for-cyberespionage/",
       "targets":[
          "United States",
          "Japan",
          "Taiwan",
          "India",
          "Canada",
          "China",
          "Thailand",
          "Israel",
          "Australia",
          "Republic of Korea",
          "Russia",
          "Iran"
       ],
       "name":"Emissary Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor uses spear-phishing techniques to compromise diplomatic targets in Southeast Asia, India, and the United States. It also seems to have targeted the APT 30. Possibly uses the same infrastructure as Mirage",
       "synonyms":[
          "Goblin Panda",
          "Cycldek"
       ],
       "link":"https://securelist.com/analysis/publications/69567/the-chronicles-of-the-hellsing-apt-the-empire-strikes-back/",
       "targets":[
          "Malaysia",
          "Indonesia",
          "Philippines",
          "United States",
          "India"
       ],
       "name":"Hellsing"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor uses phishing techniques to compromise the networks of foreign ministries of European countries for espionage purposes.",
       "synonyms":[
          "Vixen Panda",
          "Ke3Chang",
          "GREF",
          "Playful Dragon",
          "APT 15",
          "APT15",
          "Metushy",
          "Lurid",
          "Social Network Team",
          "Royal APT"
       ],
       "link":"https://attack.mitre.org/groups/G0004/",
       "targets":[
          "European Union",
          "India",
          "United Kingdom"
       ],
       "name":"Mirage"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"PLA Navy\nAnchor Panda is an adversary that CrowdStrike has tracked extensively over the last year targeting both civilian and military maritime operations in the green/brown water regions primarily in the area of operations of the South Sea Fleet of the PLA Navy. In addition to maritime operations in this region, Anchor Panda also heavily targeted western companies in the US, Germany, Sweden, the UK, and Australia, and other countries involved in maritime satellite systems, aerospace companies, and defense contractors. \nNot surprisingly, embassies and diplomatic missions in the region, foreign intelligence services, and foreign governments with space programs were also targeted.",
       "synonyms":[
          "APT14",
          "APT 14",
          "QAZTeam",
          "ALUMINUM"
       ],
       "link":"http://www.crowdstrike.com/blog/whois-anchor-panda/",
       "targets":[
          "United States",
          "United Kingdom",
          "Germany",
          "Australia",
          "Sweden"
       ],
       "name":"Anchor Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Operate since at least 2011, from several locations in China, with  members in Korea and Japan as well. Possibly linked to Onion Dog. This threat actor targets government institutions, military contractors, maritime and shipbuilding groups, telecommunications operators, and others, primarily in Japan and South Korea.",
       "synonyms":[
          "IceFog",
          "Dagger Panda"
       ],
       "link":"https://securelist.com/the-icefog-apt-a-tale-of-cloak-and-three-daggers/57331/",
       "targets":[
          "South Korea",
          "United States",
          "Japan",
          "Germany",
          "China"
       ],
       "name":"Ice Fog"
    },
    {
       "attribution":"China",
       "description":"The Pitty Tiger group has been active since at least 2011. They have been seen using HeartBleed vulnerability in order to directly get valid credentials",
       "synonyms":[
          "PittyTiger",
          "MANGANESE"
       ],
       "link":"https://attack.mitre.org/groups/G0011/",
       "name":"Pitty Panda"
    },
    {
       "attribution":"China",
       "description":"We’ve uncovered some new data and likely attribution regarding a series of APT watering hole attacks this past summer. Watering hole attacks are an increasingly popular component of APT campaigns, as many people are more aware of spear phishing and are less likely to open documents or click on links in unsolicited emails. Watering hole attacks offer a much better chance of success because they involve compromising legitimate websites and installing malware intended to compromise website visitors. These are often popular websites frequented by people who work in specific industries or have political sympathies to which the actors want to gain access.\nIn contrast to many other APT campaigns, which tend to rely heavily on spear phishing to gain victims, “th3bug” is known for compromising legitimate websites their intended visitors are likely to frequent. Over the summer they compromised several sites, including a well-known Uyghur website written in that native language.",
       "synonyms":[
          "APT20",
          "APT 20",
          "TH3Bug",
          "Twivy"
       ],
       "link":"http://researchcenter.paloaltonetworks.com/2014/09/recent-watering-hole-attacks-attributed-apt-group-th3bug-using-poison-ivy/",
       "name":"Violin Panda"
    },
    {
       "link":"http://www.rsaconference.com/writable/presentations/file_upload/anf-t07b-the-art-of-attribution-identifying-and-pursuing-your-cyber-adversaries_final.pdf",
       "attribution":"China",
       "description":"A group targeting dissident groups in China and at the boundaries.",
       "name":"Toxic Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"China-based cyber threat group. It has previously used newsworthy events as lures to deliver malware and has primarily targeted organizations involved in financial, economic, and trade policy, typically using publicly available RATs such as PoisonIvy, as well as some non-public backdoors. This threat actor targets prodemocratic activists and organizations in Hong Kong, European and international financial institutions, and a U.S.-based think tank.",
       "synonyms":[
          "Admin338",
          "Team338",
          "MAGNESIUM",
          "admin@338"
       ],
       "link":"https://attack.mitre.org/groups/G0018/",
       "targets":[
          "Hong Kong",
          "United States"
       ],
       "name":"Temper Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Activity: defense and aerospace sectors, also interested in targeting entities in the oil/gas industry.",
       "synonyms":[
          "SaffronRose",
          "Saffron Rose",
          "AjaxSecurityTeam",
          "Ajax Security Team",
          "Group 26",
          "Sayad"
       ],
       "link":"https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-operation-saffron-rose.pdf",
       "targets":[
          "United States",
          "Iranian internet activists"
       ],
       "name":"Flying Kitten"
    },
    {
       "motivation":"denial of service",
       "attribution":"Iran",
       "description":"While tracking a suspected Iran-based threat group known as Threat Group-2889[1] (TG-2889), Dell SecureWorks Counter Threat Unit™ (CTU) researchers uncovered a network of fake LinkedIn profiles. These convincing profiles form a self-referenced network of seemingly established LinkedIn users. CTU researchers assess with high confidence the purpose of this network is to target potential victims through social engineering. Most of the legitimate LinkedIn accounts associated with the fake accounts belong to individuals in the Middle East, and CTU researchers assess with medium confidence that these individuals are likely targets of TG-2889. One of the threat actors responsible for the denial of service attacks against U.S in 2012–2013. Three individuals associated with the group—believed to be have been working on behalf of Iran’s Islamic Revolutionary Guard Corps—were indicted by the Justice Department in 2016. ",
       "synonyms":[
          "ITSecTeam",
          "Threat Group 2889",
          "TG-2889",
          "Ghambar"
       ],
       "link":"http://www.secureworks.com/cyber-threat-intelligence/threats/suspected-iran-based-hacker-group-creates-network-of-fake-linkedin-profiles/",
       "targets":[
          "Bank of America",
          "US Bancorp",
          "Fifth Third Bank",
          "Citigroup",
          "PNC",
          "BB&T",
          "Wells Fargo",
          "Capital One",
          "HSBC"
       ],
       "name":"Cutting Kitten"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Charming Kitten (aka Parastoo, aka Newscaster) is an group with a suspected nexus to Iran that targets organizations involved in government, defense technology, military, and diplomacy sectors.",
       "synonyms":[
          "Newscaster",
          "Parastoo",
          "iKittens",
          "Group 83",
          "Newsbeef",
          "NewsBeef"
       ],
       "link":"https://attack.mitre.org/groups/G0058/",
       "targets":[
          "U.S. government/defense sector websites",
          "Saudi Arabia",
          "Israel",
          "Iraq",
          "United Kingdom"
       ],
       "name":"Charming Kitten"
    },
    {
       "attribution":"Iran",
       "description":"Our analysis reveals that APT33 is a capable group that has carried out cyber espionage operations since at least 2013. We assess APT33 works at the behest of the Iranian government.",
       "synonyms":[
          "APT 33",
          "Elfin",
          "MAGNALLIUM",
          "Refined Kitten"
       ],
       "link":"https://www.fireeye.com/blog/threat-research/2017/09/apt33-insights-into-iranian-cyber-espionage.html",
       "name":"APT33"
    },
    {
       "attribution":"Iran",
       "description":"Earliest activity back to November 2008. An established group of cyber attackers based in Iran, who carried on several campaigns in 2013, including a series of attacks targeting political dissidents and those supporting Iranian political opposition.",
       "synonyms":[
          "Group 42"
       ],
       "link":"http://www.scmagazineuk.com/iran-and-russia-blamed-for-state-sponsored-espionage/article/330401/",
       "name":"Magic Kitten"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Targets Saudi Arabia, Israel, US, Iran, high ranking defense officials, embassies of various target countries, notable Iran researchers, human rights activists, media and journalists, academic institutions and various scholars, including scientists in the fields of physics and nuclear sciences.",
       "synonyms":[
          "TEMP.Beanie",
          "Operation Woolen Goldfish",
          "Operation Woolen-Goldfish",
          "Thamar Reservoir",
          "Timberworm"
       ],
       "link":"https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishing",
       "targets":[
          "Saudi Arabia",
          "Venezuela",
          "Afghanistan",
          "United Arab Emirates",
          "Iran",
          "Israel",
          "Iraq",
          "Kuwait",
          "Turkey",
          "Canada",
          "Yemen",
          "United Kingdom",
          "Egypt",
          "Syria",
          "Jordan"
       ],
       "name":"Rocket Kitten"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"A group of cyber actors utilizing infrastructure located in Iran have been conducting computer network exploitation activity against public and private U.S. organizations, including Cleared Defense Contractors (CDCs), academic institutions, and energy sector companies. This threat actor targets entities in the government, energy, and technology sectors that are located in or do business with Saudi Arabia.",
       "synonyms":[
          "Operation Cleaver",
          "Tarh Andishan",
          "Alibaba",
          "2889",
          "TG-2889",
          "Cobalt Gypsy",
          "Rocket_Kitten",
          "Cutting Kitten",
          "Group 41",
          "Magic Hound",
          "APT35",
          "APT 35",
          "TEMP.Beanie",
          "Ghambar"
       ],
       "link":"https://attack.mitre.org/groups/G0059/",
       "targets":[
          "Canada",
          "France",
          "Israel",
          "Mexico",
          "Saudi Arabia",
          "China",
          "Germany",
          "United States",
          "Pakistan",
          "South Korea",
          "United Kingdom",
          "India",
          "Kuwait",
          "Qatar",
          "Turkey"
       ],
       "name":"Cleaver"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"The Sofacy Group (also known as APT28, Pawn Storm, Fancy Bear and Sednit) is a cyber espionage group believed to have ties to the Russian government. Likely operating since 2007, the group is known to target government, military, and security organizations. It has been characterized as an advanced persistent threat.",
       "synonyms":[
          "APT 28",
          "APT28",
          "Pawn Storm",
          "PawnStorm",
          "Fancy Bear",
          "Sednit",
          "SNAKEMACKEREL",
          "TsarTeam",
          "Tsar Team",
          "TG-4127",
          "Group-4127",
          "STRONTIUM",
          "TAG_0700",
          "Swallowtail",
          "IRON TWILIGHT",
          "Group 74",
          "SIG40",
          "Grizzly Steppe",
          "apt_sofacy"
       ],
       "link":"https://attack.mitre.org/groups/G0007/",
       "targets":[
          "Georgia",
          "France",
          "Jordan",
          "United States",
          "Hungary",
          "World Anti-Doping Agency",
          "Armenia",
          "Tajikistan",
          "Japan",
          "NATO",
          "Ukraine",
          "Belgium",
          "Pakistan",
          "Asia Pacific Economic Cooperation",
          "International Association of Athletics Federations",
          "Turkey",
          "Mongolia",
          "OSCE",
          "United Kingdom",
          "Germany",
          "Poland",
          "European Commission",
          "Afghanistan",
          "Kazakhstan",
          "China"
       ],
       "name":"Sofacy"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"A 2015 report by F-Secure describe APT29 as: 'The Dukes are a well-resourced, highly dedicated and organized cyberespionage group that we believe has been working for the Russian Federation since at least 2008 to collect intelligence in support of foreign and security policy decision-making. The Dukes show unusual confidence in their ability to continue successfully compromising their targets, as well as in their ability to operate with impunity. The Dukes primarily target Western governments and related organizations, such as government ministries and agencies, political think tanks, and governmental subcontractors. Their targets have also included the governments of members of the Commonwealth of Independent States;Asian, African, and Middle Eastern governments;organizations associated with Chechen extremism;and Russian speakers engaged in the illicit trade of controlled substances and drugs. The Dukes are known to employ a vast arsenal of malware toolsets, which we identify as MiniDuke, CosmicDuke, OnionDuke, CozyDuke, CloudDuke, SeaDuke, HammerDuke, PinchDuke, and GeminiDuke. In recent years, the Dukes have engaged in apparently biannual large - scale spear - phishing campaigns against hundreds or even thousands of recipients associated with governmental institutions and affiliated organizations. These campaigns utilize a smash - and - grab approach involving a fast but noisy breakin followed by the rapid collection and exfiltration of as much data as possible.If the compromised target is discovered to be of value, the Dukes will quickly switch the toolset used and move to using stealthier tactics focused on persistent compromise and long - term intelligence gathering. This threat actor targets government ministries and agencies in the West, Central Asia, East Africa, and the Middle East; Chechen extremist groups; Russian organized crime; and think tanks. It is suspected to be behind the 2015 compromise of unclassified networks at the White House, Department of State, Pentagon, and the Joint Chiefs of Staff. The threat actor includes all of the Dukes tool sets, including MiniDuke, CosmicDuke, OnionDuke, CozyDuke, SeaDuke, CloudDuke (aka MiniDionis), and HammerDuke (aka Hammertoss). '",
       "synonyms":[
          "Dukes",
          "Group 100",
          "Cozy Duke",
          "CozyDuke",
          "EuroAPT",
          "CozyBear",
          "CozyCar",
          "Cozer",
          "Office Monkeys",
          "OfficeMonkeys",
          "APT29",
          "Cozy Bear",
          "The Dukes",
          "Minidionis",
          "SeaDuke",
          "Hammer Toss",
          "YTTRIUM",
          "Iron Hemlock",
          "Grizzly Steppe"
       ],
       "link":"https://labsblog.f-secure.com/2015/09/17/the-dukes-7-years-of-russian-cyber-espionage/",
       "targets":[
          "United States",
          "China",
          "New Zealand",
          "Ukraine",
          "Romania",
          "Georgia",
          "Japan",
          "South Korea",
          "Belgium",
          "Kazakhstan",
          "Brazil",
          "Mexico",
          "Turkey",
          "Portugal",
          "India"
       ],
       "name":"APT 29"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"A 2014 Guardian article described Turla as: 'Dubbed the Turla hackers, initial intelligence had indicated western powers were key targets, but it was later determined embassies for Eastern Bloc nations were of more interest. Embassies in Belgium, Ukraine, China, Jordan, Greece, Kazakhstan, Armenia, Poland, and Germany were all attacked, though researchers from Kaspersky Lab and Symantec could not confirm which countries were the true targets. In one case from May 2012, the office of the prime minister of a former Soviet Union member country was infected, leading to 60 further computers being affected, Symantec researchers said. There were some other victims, including the ministry for health of a Western European country, the ministry for education of a Central American country, a state electricity provider in the Middle East and a medical organisation in the US, according to Symantec. It is believed the group was also responsible for a much - documented 2008 attack on the US Central Command. The attackers - who continue to operate - have ostensibly sought to carry out surveillance on targets and pilfer data, though their use of encryption across their networks has made it difficult to ascertain exactly what the hackers took.Kaspersky Lab, however, picked up a number of the attackers searches through their victims emails, which included terms such as Nato and EU energy dialogue Though attribution is difficult to substantiate, Russia has previously been suspected of carrying out the attacks and Symantecs Gavin O’ Gorman told the Guardian a number of the hackers appeared to be using Russian names and language in their notes for their malicious code. Cyrillic was also seen in use.'",
       "synonyms":[
          "Turla",
          "Snake",
          "Venomous Bear",
          "VENOMOUS Bear",
          "Group 88",
          "Waterbug",
          "WRAITH",
          "Turla Team",
          "Uroburos",
          "Pfinet",
          "TAG_0530",
          "KRYPTON",
          "Hippo Team",
          "Pacifier APT",
          "Popeye",
          "SIG23",
          "Iron Hunter",
          "MAKERSMARK"
       ],
       "link":"https://attack.mitre.org/groups/G0010/",
       "targets":[
          "France",
          "Romania",
          "Kazakhstan",
          "Poland",
          "Tajikistan",
          "Russia",
          "United States",
          "Saudi Arabia",
          "Germany",
          "India",
          "Belarus",
          "Netherlands",
          "Iran",
          "Uzbekistan",
          "Iraq"
       ],
       "name":"Turla Group"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"A Russian group that collects intelligence on the energy industry.",
       "synonyms":[
          "Dragonfly",
          "Crouching Yeti",
          "Group 24",
          "Havex",
          "CrouchingYeti",
          "Koala Team",
          "IRON LIBERTY"
       ],
       "link":"https://attack.mitre.org/groups/G0035/",
       "targets":[
          "United States",
          "Germany",
          "Turkey",
          "China",
          "Spain",
          "France",
          "Ireland",
          "Japan",
          "Italy",
          "Poland"
       ],
       "name":"Energetic Bear"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"This threat actor targets industrial control systems, using a tool called Black Energy, associated with electricity and power generation for espionage, denial of service, and data destruction purposes. Some believe that the threat actor is linked to the 2015 compromise of the Ukrainian electrical grid and a distributed denial of service prior to the Russian invasion of Georgia. Believed to be responsible for the 2008 DDoS attacks in Georgia and the 2015 Ukraine power grid outage",
       "synonyms":[
          "Sandworm Team",
          "Black Energy",
          "BlackEnergy",
          "Quedagh",
          "Voodoo Bear",
          "TEMP.Noble",
          "Iron Viking"
       ],
       "link":"https://attack.mitre.org/groups/G0034/",
       "targets":[
          "Russia",
          "Lithuania",
          "Kyrgyzstan",
          "Israel",
          "Ukraine",
          "Belarus",
          "Kazakhstan",
          "Georgia",
          "Poland",
          "Azerbaijan",
          "Iran"
       ],
       "name":"Sandworm"
    },
    {
       "attribution":"Russia",
       "description":"We will refer to the gang behind the malware as TeleBots. However it’s important to say that these attackers, and the toolset used, share a number of similarities with the BlackEnergy group, which conducted attacks against the energy industry in Ukraine in December 2015 and January 2016. In fact, we think that the BlackEnergy group has evolved into the TeleBots group. TeleBots appear to be associated with Sandworm Team, Iron Viking, Voodoo Bear.",
       "synonyms":[
          "Sandworm"
       ],
       "link":"http://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/",
       "name":"TeleBots"
    },
    {
       "attribution":"Russia",
       "description":"Groups targeting financial organizations or people with significant financial assets.",
       "synonyms":[
          "Carbanak",
          "Carbon Spider",
          "FIN7"
       ],
       "link":"https://attack.mitre.org/groups/G0008/",
       "name":"Anunak"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"Researchers have uncovered a long-term cyber-espionage campaign that used a combination of legitimate software packages and commodity malware tools to target a variety of heavy industry, government intelligence agencies and political activists. Known as the TeamSpy crew because of its affinity for using the legitimate TeamViewer application as part of its toolset, the attackers may have been active for as long as 10 years, researchers say.\nThe attack appears to be a years-long espionage campaign, but experts who have analyzed the victim profile, malware components and command-and-control infrastructure say that it’s not entirely clear what kind of data the attackers are going after. What is clear, though, is that the attackers have been at this for a long time and that they have specific people in mind as targets.\nResearchers at the CrySyS Lab in Hungary were alerted by the Hungarian National Security Authority to an attack against a high-profile target in the country and began looking into the campaign. They quickly discovered that some of the infrastructure being used in the attack had been in use for some time and that the target they were investigating was by no means the only one.",
       "synonyms":[
          "TeamSpy",
          "Team Bear",
          "Berserk Bear",
          "Anger Bear",
          "IRON LYRIC"
       ],
       "link":"https://securelist.com/blog/incidents/35520/the-teamspy-crew-attacks-abusing-teamviewer-for-cyberespionage-8/",
       "targets":[
          "Hungary",
          "Belarus"
       ],
       "name":"TeamSpy Crew"
    },
    {
       "link":"https://www.welivesecurity.com/2015/11/11/operation-buhtrap-malware-distributed-via-ammyy-com/",
       "attribution":"Russia",
       "description":"Buhtrap has been active since 2014, however their first attacks against financial institutions were only detected in August 2015. Earlier, the group had only focused on targeting banking clients. At the moment, the group is known to target Russian and Ukrainian banks.\nFrom August 2015 to February 2016 Buhtrap managed to conduct 13 successful attacks against Russian banks for a total amount of 1.8 billion rubles ($25.7 mln). The number of successful attacks against Ukrainian banks has not been identified.\nBuhtrap is the first hacker group using a network worm to infect the overall bank infrastructure that significantly increases the difficulty of removing all malicious functions from the network. As a result, banks have to shut down the whole infrastructure which provokes delay in servicing customers and additional losses.\nMalicious programs intentionally scan for machines with an automated Bank-Customer system of the Central Bank of Russia (further referred to as BCS CBR). We have not identified incidents of attacks involving online money transfer systems, ATM machines or payment gates which are known to be of interest for other criminal groups.",
       "name":"BuhTrap"
    },
    {
       "attribution":"Romania",
       "description":"FIN4 is a financially-motivated threat group that has targeted confidential information related to the public financial market, particularly regarding healthcare and pharmaceutical companies, since at least 2013. FIN4 is unique in that they do not infect victims with typical persistent malware, but rather they focus on capturing credentials authorized to access email and other non-public correspondence.",
       "synonyms":[
          "FIN4"
       ],
       "link":"https://attack.mitre.org/groups/G0085/",
       "name":"Wolf Spider"
    },
    {
       "link":"http://www.rsaconference.com/writable/presentations/file_upload/anf-t07b-the-art-of-attribution-identifying-and-pursuing-your-cyber-adversaries_final.pdf",
       "attribution":"Russia",
       "description":"Adversary targeting manufacturing and industrial organizations.",
       "name":"Union Spider"
    },
    {
       "motivation": "espionage and sabotage",
       "attribution":"North Korea",
       "description":"Since 2009, HIDDEN COBRA actors have leveraged their capabilities to target and compromise a range of victims; some intrusions have resulted in the exfiltration of data while others have been disruptive in nature. Commercial reporting has referred to this activity as Lazarus Group and Guardians of Peace. Tools and capabilities used by HIDDEN COBRA actors include DDoS botnets, keyloggers, remote access tools (RATs), and wiper malware. Variants of malware and tools used by HIDDEN COBRA actors include Destover, Duuzer, and Hangman.",
       "synonyms":[
          "Operation DarkSeoul",
          "Dark Seoul",
          "Hidden Cobra",
          "Hastati Group",
          "Andariel",
          "Unit 121",
          "Bureau 121",
          "NewRomanic Cyber Army Team",
          "Bluenoroff",
          "Subgroup: Bluenoroff",
          "Group 77",
          "Labyrinth Chollima",
          "Operation Troy",
          "Operation GhostSecret",
          "Operation AppleJeus",
          "APT38",
          "APT 38",
          "Stardust Chollima",
          "Whois Hacking Team",
          "Zinc",
          "Appleworm",
          "Nickel Academy",
          "APT-C-26"
       ],
       "link":"https://threatpost.com/operation-blockbuster-coalition-ties-destructive-attacks-to-lazarus-group/116422/",
       "targets":[
          "South Korea",
          "Bangladesh Bank",
          "Sony Pictures Entertainment",
          "United States",
          "Thailand",
          "France",
          "China",
          "Hong Kong",
          "United Kingdom",
          "Guatemala",
          "Canada",
          "Bangladesh",
          "Japan",
          "India",
          "Germany",
          "Brazil",
          "Thailand",
          "Australia",
          "Cryptocurrency exchanges in South Korea"
       ],
       "name":"Lazarus Group"
    },
    {
       "motivation":"espionage",
       "attribution":"France",
       "description":"In 2014, researchers at Kaspersky Lab discovered and reported on three zero-days that were being used in cyberattacks in the wild. Two of these zero-day vulnerabilities are associated with an advanced threat actor we call Animal Farm. Over the past few years, Animal Farm has targeted a wide range of global organizations. The group has been active since at least 2009 and there are signs that earlier malware versions  were developed as far back as 2007.",
       "synonyms":[
          "Animal Farm",
          "Snowglobe"
       ],
       "link":"https://securelist.com/blog/research/69114/animals-in-the-apt-farm/",
       "targets":[
          "Syria",
          "United States",
          "Netherlands",
          "Russia",
          "Spain",
          "Iran",
          "China",
          "Germany",
          "Algeria",
          "Norway",
          "Malaysia",
          "Turkey",
          "United Kingdom",
          "Ivory Coast",
          "Greece"
       ],
       "name":"SNOWGLOBE"
    },
    {
       "attribution":"Syria",
       "description":"The Syrian Electronic Army (SEA) is a group of computer hackers which first surfaced online in 2011 to support the government of Syrian President Bashar al-Assad. Using spamming, website defacement, malware, phishing, and denial of service attacks, it has targeted political opposition groups, western news organizations, human rights groups and websites that are seemingly neutral to the Syrian conflict. It has also hacked government websites in the Middle East and Europe, as well as US defense contractors. As of 2011 the SEA has been *the first Arab country to have a public Internet Army hosted on its national networks to openly launch cyber attacks on its enemies*. The precise nature of SEA's relationship with the Syrian government has changed over time and is unclear",
       "synonyms":[
          "SyrianElectronicArmy",
          "SEA"
       ],
       "link":"https://en.wikipedia.org/wiki/Syrian_Electronic_Army",
       "name":"Deadeye Jackal"
    },
    {
       "attribution":"Pakistan",
       "description":"Group targeting Indian Army or related assets in India, as well as activists and civil society in Pakistan. Attribution to a Pakistani connection has been made by TrendMicro and others.",
       "synonyms":[
          "C-Major",
          "Transparent Tribe",
          "Mythic Leopard",
          "ProjectM",
          "APT36",
          "APT 36",
          "TMP.Lapis"
       ],
       "link":"http://documents.trendmicro.com/assets/pdf/Indian-military-personnel-targeted-by-information-theft-campaign-cmajor.pdf",
       "name":"Operation C-Major"
    },
    {
       "motivation":"espionage",
       "attribution":"United Arab Emirates",
       "description":"This threat actor targets civil society groups and Emirati journalists, activists, and dissidents. ",
       "synonyms":[
          "FruityArmor"
       ],
       "link":"https://attack.mitre.org/groups/G0038/",
       "targets":[
          "United Arab Emirates",
          "United Kingdom"
       ],
       "name":"Stealth Falcon"
    },
    {
       "link":"http://blog.checkpoint.com/wp-content/uploads/2016/07/HummingBad-Research-report_FINAL-62916.pdf",
       "attribution":"China",
       "description":"This group created a malware that takes over Android devices and generates $300,000 per month in fraudulent ad revenue.  The group effectively controls an arsenal of over 85 million mobile devices around the world. With the potential to sell access to these devices to the highest bidder",
       "name":"HummingBad"
    },
    {
       "motivation":"espionage",
       "attribution":"India",
       "description":"Dropping Elephant (also known as “Chinastrats” and “Patchwork“) is a relatively new threat actor that is targeting a variety of high profile diplomatic and economic targets using a custom set of attack tools. Its victims are all involved with China’s foreign relations in some way, and are generally caught through spear-phishing or watering hole attacks.",
       "synonyms":[
          "Chinastrats",
          "Patchwork",
          "Monsoon",
          "Sarit",
          "Quilted Tiger",
          "APT-C-09"
       ],
       "link":"https://attack.mitre.org/groups/G0040/",
       "targets":[
          "Bangladesh",
          "Sri Lanka",
          "Pakistan"
       ],
       "name":"Dropping Elephant"
    },
    {
       "link":"https://attack.mitre.org/wiki/Groups",
       "attribution":"China",
       "description":"Scarlet Mimic is a threat group that has targeted minority rights activists. This group has not been directly linked to a government source, but the group’s motivations appear to overlap with those of the Chinese government. While there is some overlap between IP addresses used by Scarlet Mimic and Putter Panda, APT 2, it has not been concluded that the groups are the same.\nThe attacks began over four years ago and their targeting pattern suggests that this adversary’s primary mission is to gather information about minority rights activists. We do not have evidence directly linking these attacks to a government source, but the information derived from these activities supports an assessment that a group or groups with motivations similar to the stated position of the Chinese government in relation to these targets is involved.\nThe attacks we attribute to Scarlet Mimic have primarily targeted Uyghur and Tibetan activists as well as those who are interested in their causes. Both the Tibetan community and the Uyghurs, a Turkic Muslim minority residing primarily in northwest China, have been targets of multiple sophisticated attacks in the past decade. Both also have history of strained relationships with the government of the People’s Republic of China (PRC), though we do not have evidence that links Scarlet Mimic attacks to the PRC.\nScarlet Mimic attacks have also been identified against government organizations in Russia and India, who are responsible for tracking activist and terrorist activities. While we do not know the precise target of each of the Scarlet Mimic attacks, many of them align to the patterns described above.",
       "name":"Scarlet Mimic"
    },
    {
       "link":"https://attack.mitre.org/wiki/Groups",
       "attribution":"Brazil",
       "description":"Poseidon Group is a Portuguese-speaking threat group that has been active since at least 2005. The group has a history of using information exfiltrated from victims to blackmail victim companies into contracting the Poseidon Group as a security firm.",
       "name":"Poseidon Group"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Threat group that has targeted Japanese organizations with phishing emails. Due to overlapping TTPs, including similar custom tools, DragonOK is thought to have a direct or indirect relationship with the threat group Moafee. 2223 It is known to use a variety of malware, including Sysget/HelloBridge, PlugX, PoisonIvy, FormerFirstRat, NFlog, and NewCT.",
       "synonyms":[
          "Moafee"
       ],
       "link":"https://attack.mitre.org/wiki/Groups",
       "targets":[
          "United States"
       ],
       "name":"DragonOK"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Chinese threat group that has extensively used strategic Web compromises to target victims.",
       "synonyms":[
          "TG-3390",
          "Emissary Panda"
       ],
       "link":"https://attack.mitre.org",
       "targets":[
          "United States",
          "United Kingdom",
          "France"
       ],
       "name":"Threat Group-3390"
    },
    {
       "motivation":"espionage",
       "attribution":"United States of America",
       "description":"ProjectSauron is the name for a top level modular cyber-espionage platform, designed to enable and manage long-term campaigns through stealthy survival mechanisms coupled with multiple exfiltration methods.  Technical details show how attackers learned from other extremely advanced actors in order to avoid repeating their mistakes. As such, all artifacts are customized per given target, reducing their value as indicators of compromise for any other victim.  Usually APT campaigns have a geographical nexus, aimed at extracting information within a specific region or from a given industry. That usually results in several infections in countries within that region, or in the targeted industry around the world. Interestingly, ProjectSauron seems to be dedicated to just a couple of countries, focused on collecting high value intelligence by compromising almost all key entities it could possibly reach within the target area.  The name, ProjectSauron reflects the fact that the code authors refer to ‘Sauron’ in the Lua scripts.",
       "synonyms":[
          "Strider",
          "Sauron",
          "Project Sauron"
       ],
       "link":"https://attack.mitre.org/groups/G0041/",
       "targets":[
          "Russia",
          "Iran",
          "Belgium",
          "China",
          "Sweden",
          "Rwanda"
       ],
       "name":"ProjectSauron"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"APT 30 is a threat group suspected to be associated with the Chinese government. While Naikon shares some characteristics with APT30, the two groups do not appear to be exact matches.",
       "synonyms":[
          "APT30"
       ],
       "link":"https://attack.mitre.org/wiki/Group/G0013",
       "targets":[
          "India",
          "Saudi Arabia",
          "Vietnam",
          "Myanmar",
          "Singapore",
          "Thailand",
          "Malaysia",
          "Cambodia",
          "China",
          "Phillipines",
          "South Korea",
          "United States",
          "Indonesia",
          "Laos"
       ],
       "name":"APT 30"
    },
    {
       "link":"https://www.proofpoint.com/uk/threat-insight/post/august-in-december-new-information-stealer-hits-the-scene",
       "attribution":"China",
       "description":"TA530, who we previously examined in relation to large-scale personalized phishing campaigns",
       "name":"TA530"
    },
    {
       "link":"https://attack.mitre.org/groups/G0036/",
       "attribution":"Russia",
       "description":"GCMAN is a threat group that focuses on targeting banks for the purpose of transferring money to e-currency services.",
       "name":"GCMAN"
    },
    {
       "link":"https://attack.mitre.org/groups/G0039/",
       "attribution":"China",
       "description":"Suckfly is a China-based threat group that has been active since at least 2014",
       "name":"Suckfly"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"OilRig is an Iranian threat group operating primarily in the Middle East by targeting organizations in this region that are in a variety of different industries; however, this group has occasionally targeted organizations outside of the Middle East as well. It also appears OilRig carries out supply chain attacks, where the threat group leverages the trust relationship between organizations to attack their primary targets. \nOilRig is an active and organized threat group, which is evident based on their systematic targeting of specific organizations that appear to be carefully chosen for strategic purposes. Attacks attributed to this group primarily rely on social engineering to exploit the human rather than software vulnerabilities; however, on occasion this group has used recently patched vulnerabilities in the delivery phase of their attacks. The lack of software vulnerability exploitation does not necessarily suggest a lack of sophistication, as OilRig has shown maturity in other aspects of their operations. Such maturities involve:\n-Organized evasion testing used the during development of their tools.\n-Use of custom DNS Tunneling protocols for command and control (C2) and data exfiltration.\n-Custom web-shells and backdoors used to persistently access servers.\nOilRig relies on stolen account credentials for lateral movement. After OilRig gains access to a system, they use credential dumping tools, such as Mimikatz, to steal credentials to accounts logged into the compromised system. The group uses these credentials to access and to move laterally to other systems on the network. After obtaining credentials from a system, operators in this group prefer to use tools other than their backdoors to access the compromised systems, such as remote desktop and putty. OilRig also uses phishing sites to harvest credentials to individuals at targeted organizations to gain access to internet accessible resources, such as Outlook Web Access.",
       "synonyms":[
          "Twisted Kitten",
          "Cobalt Gypsy",
          "Crambus",
          "Helix Kitten",
          "APT 34",
          "APT34",
          "IRN2"
       ],
       "link":"https://attack.mitre.org/groups/G0049/",
       "targets":[
          "Israel",
          "Kuwait",
          "United States",
          "Turkey",
          "Saudi Arabia",
          "Qatar",
          "Lebanon"
       ],
       "name":"OilRig"
    },
    {
       "attribution":"Turkey",
       "description":"PROMETHIUM is an activity group that has been active as early as 2012. The group primarily uses Truvasys, a first-stage malware that has been in circulation for several years. Truvasys has been involved in several attack campaigns, where it has masqueraded as one of server common computer utilities, including WinUtils, TrueCrypt, WinRAR, or SanDisk. In each of the campaigns, Truvasys malware evolved with additional features—this shows a close relationship between the activity groups behind the campaigns and the developers of the malware.",
       "synonyms":[
          "StrongPity"
       ],
       "link":"https://attack.mitre.org/groups/G0055/",
       "name":"PROMETHIUM"
    },
    {
       "link":"https://www.symantec.com/connect/blogs/iran-based-attackers-use-back-door-threats-spy-middle-eastern-targets",
       "attribution":"Iran",
       "description":"Symantec telemetry identified Cadelle and Chafer activity dating from as far back as July 2014, however, it’s likely that activity began well before this date. Command-and-control (C&C) registrant information points to activity possibly as early as 2011, while executable compilation times suggest early 2012. Their attacks continue to the present day. Symantec estimates that each team is made up of between 5 and 10 people.",
       "name":"Cadelle"
    },
    {
       "link":"https://www.symantec.com/connect/blogs/iran-based-attackers-use-back-door-threats-spy-middle-eastern-targets",
       "attribution":"Iran",
       "description":"Symantec telemetry identified Cadelle and Chafer activity dating from as far back as July 2014, however, it’s likely that activity began well before this date. Command-and-control (C&C) registrant information points to activity possibly as early as 2011, while executable compilation times suggest early 2012. Their attacks continue to the present day. Symantec estimates that each team is made up of between 5 and 10 people.",
       "name":"Chafer"
    },
    {
       "link":"https://threatvector.cylance.com/en_us/home/digitally-signed-malware-targeting-gaming-companies.html",
       "attribution":"China",
       "description":"The PassCV group continues to be one of the most successful and active threat groups that leverage a wide array of stolen Authenticode-signing certificates.  Snorre Fagerland of Blue Coat Systems first coined the term PassCV in a blog post. His post provides a good introduction to the group and covers some of the older infrastructure, stolen code-signing certificate reuse, and other connections associated with the PassCV malware. There are several clues alluding to the possibility that multiple groups may be utilizing the same stolen signing certificates, but at this time SPEAR believes the current attacks are more likely being perpetrated by a single group employing multiple publicly available Remote Administration Tools (RATs).  The PassCV group has been operating with continued success and has already started to expand their malware repertoire into different off-the-shelf RATs and custom code. SPEAR identified eighteen previously undisclosed stolen Authenticode certificates. These certificates were originally issued to companies and individuals scattered across China, Taiwan, Korea, Europe, the United States and Russia.  In this post we expand the usage of the term ‘PassCV’ to encompass the malware mentioned in the Blue Coat Systems report, as well as the APT group behind the larger C2 infrastructure and stolen Authenticode certificates. We’d like to share some of our findings as they pertain to the stolen certificates, command and control infrastructure, and some of the newer custom RATs they’ve begun development on.",
       "name":"PassCV"
    },
    {
       "motivation":"espionage",
       "attribution":"United States of America",
       "description":"The Equation Group is a highly sophisticated threat actor described by its discoverers at Kaspersky Labs as one of the most sophisticated cyber attack groups in the world, operating alongside but always from a position of superiority with the creators of Stuxnet and Flame",
       "synonyms":[
          "Tilded Team",
          "Lamberts",
          "EQGRP",
          "Longhorn"
       ],
       "link":"https://attack.mitre.org/groups/G0020/",
       "targets":[
          "Iran",
          "Afghanistan",
          "Syria",
          "Yemen",
          "Kenya",
          "Russia",
          "India",
          "Mali",
          "Algeria",
          "United Kingdom",
          "Pakistan",
          "China",
          "Lebanon",
          "United Arab Emirates",
          "Libya"
       ],
       "name":"Equation Group"
    },
    {
       "link":"https://www.symantec.com/connect/blogs/greenbug-cyberespionage-group-targeting-middle-east-possible-links-shamoon",
       "attribution":"Iran",
       "description":"Greenbug was discovered targeting a range of organizations in the Middle East including companies in the aviation, energy, government, investment, and education sectors.",
       "name":"Greenbug"
    },
    {
       "attribution":"China",
       "description":"Hammer Panda is a group of suspected Chinese origin targeting organisations in Russia.",
       "synonyms":[
          "Zhenbao",
          "TEMP.Zhenbao"
       ],
       "link":"http://www.darkreading.com/endpoint/chinese-cyberspies-pivot-to-russia-in-wake-of-obama-xi-pact/d/d-id/1324242",
       "name":"Hammer Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Infy is a group of suspected Iranian origin.\nSince early 2013, we have observed activity from a unique threat actor group, which we began to investigate based on increased activities against human right activists in the beginning of 2015. In line5with other research on the campaign, released prior to publication of this document, we have adopted the name “Infy”, which is based on labels used in the infrastructure and its two families of malware agents.\nThanks to information we have been able to collect during the course of our research, such as characteristics of the group’s malware and development cycle, our research strongly supports the claim that the Infy group is of Iranian origin and potentially connected to the Iranian state. Amongst a backdrop of other incidents, Infy became one of the most frequently observed agents for attempted malware attacks against Iranian civil society beginning in late 2014, growing in use up to the February 2016 parliamentary election in Iran. After the conclusion of the parliamentary election, the rate of attempted intrusions and new compromises through the Infy agent slowed, but did not end. The trends witnessed in reports from recipients are reinforced through telemetry provided by design failures in more recent versions of the Infy malware.",
       "synonyms":[
          "Operation Mermaid",
          "Prince of Persia"
       ],
       "link":"https://www.blackhat.com/docs/us-16/materials/us-16-Guarnieri-Iran-And-The-Soft-War-For-Internet-Dominance-wp.pdf",
       "targets":[
          "Israel",
          "Iran",
          "France",
          "China",
          "Sweden",
          "United States",
          "United Kingdom",
          "Germany",
          "Syria",
          "Italy",
          "Denmark",
          "Canada",
          "Russia",
          "Saudi Arabia",
          "Bahrain"
       ],
       "name":"Infy"
    },
    {
       "link":"https://www.blackhat.com/docs/us-16/materials/us-16-Guarnieri-Iran-And-The-Soft-War-For-Internet-Dominance-wp.pdf",
       "attribution":"Iran",
       "description":"Sima is a group of suspected Iranian origin targeting Iranians in diaspora.\nIn February 2016, Iran-focused individuals received messages purporting to be from Human RightsWatch's (HRW) Emergencies Director, requesting that they read an article about Iran pressing Afghanr efugees to fight in Syria. While referencing a real report published by HRW, the links provided for the Director’s biography and article directed the recipient to malware hosted elsewhere. These spear-phishing attempts represent an evolution of Iranian actors based on their social engineering tactics and narrow targeting. Although the messages still had minor grammatical and stylistic errors that would be obvious to a native speaker, the actors demonstrated stronger English-language proficiency than past intrusion sets and a deeper investment in background research prior to the attempt. The actors appropriated a real identity that would be expected to professionally interact with the subject, then offered validation through links to their biography and social media, the former of which itself was malware as well. The bait documents contained a real article relevant to their interests and topic referenced, and the message attempted to address to how it aligned with their professional research or field of employment. The referenced documents sent were malware binaries posing as legitimate files using the common right-to-left filenames tactic in order to conceal the actual file extension. All of these techniques, while common pretexting mechanisms, are a refinement compared to a tendency amongst other groups to simply continually send different forms of generic malware or phishing, in the hopes that one would eventually be successful.",
       "name":"Sima"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Blue Termite is a group of suspected Chinese origin active in Japan.",
       "synonyms":[
          "Cloudy Omega",
          "Emdivi"
       ],
       "link":"https://securelist.com/blog/research/71876/new-activity-of-the-blue-termite-apt/",
       "targets":[
          "Japan"
       ],
       "name":"Blue Termite"
    },
    {
       "link":"http://www.welivesecurity.com/2016/05/18/groundbait",
       "attribution":"Ukraine",
       "description":"Groundbait is a group targeting anti-government separatists in the self-declared Donetsk and Luhansk People’s Republics.",
       "name":"Groundbait"
    },
    {
       "motivation":"espionage",
       "attribution":"United States of America",
       "description":"Longhorn has been active since at least 2011. It has used a range of back door Trojans in addition to zero-day vulnerabilities to compromise its targets. Longhorn has infiltrated governments and internationally operating organizations, in addition to targets in the financial, telecoms, energy, aerospace, information technology, education, and natural resources sectors. All of the organizations targeted would be of interest to a nation-state attacker.  Longhorn has infected 40 targets in at least 16 countries across the Middle East, Europe, Asia, and Africa. On one occasion a computer in the United States was compromised but, following infection, an uninstaller was launched within hours, which may indicate this victim was infected unintentionally. According to cfr, this threat actor compromises governments, international organizations, academic institutions, and financial, telecommunications, energy, aerospace, information technology, and natural resource  industries for espionage purposes. Some of the tools used by this threat actor were released by Wikileaks under the name 'Vault 7.'",
       "synonyms":[
          "Lamberts",
          "the Lamberts"
       ],
       "link":"https://www.symantec.com/connect/blogs/longhorn-tools-used-cyberespionage-group-linked-vault-7",
       "targets":[
          "Global"
       ],
       "name":"Longhorn"
    },
    {
       "motivation":"espionage",
       "attribution":"Vietnam",
       "description":"Cyber espionage actors, now designated by FireEye as APT32 (OceanLotus Group), are carrying out intrusions into private sector companies across multiple industries and have also targeted foreign governments, dissidents, and journalists. FireEye assesses that APT32 leverages a unique suite of fully-featured malware, in conjunction with commercially-available tools, to conduct targeted operations that are aligned with Vietnamese state interests.",
       "synonyms":[
          "OceanLotus Group",
          "Ocean Lotus",
          "OceanLotus",
          "Cobalt Kitty",
          "APT-C-00",
          "SeaLotus",
          "Sea Lotus",
          "APT-32",
          "APT 32",
          "Ocean Buffalo"
       ],
       "link":"https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html",
       "targets":[
          "China",
          "Germany",
          "United States",
          "Vietnam",
          "Philippines",
          "Association of Southeast Asian Nations"
       ],
       "name":"APT32"
    },
    {
       "link":"https://www.paloaltonetworks.com/content/dam/pan/en_US/assets/pdf/reports/Unit_42/silverterrier-next-evolution-in-nigerian-cybercrime.pdf",
       "attribution":"Nigeria",
       "description":"As these tools rise and fall in popularity (and more importantly, as detection rates by antivirus vendors improve), SilverTerrier actors have consistently adopted new malware families and shifted to the latest packing tools available. ",
       "name":"SilverTerrier"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor targets organizations in the critical infrastructure, heavy industry, manufacturing, and international relations sectors for espionage purposes.",
       "synonyms":[
          "Bronze Butler",
          "RedBaldKnight"
       ],
       "link":"https://attack.mitre.org/groups/G0060/",
       "targets":[
          "Japan",
          "China",
          "Korea (Republic of)",
          "Russian Federation"
       ],
       "name":"Tick"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Kaspersky Lab and Seculert worked together to sinkhole the Madi Command & Control (C&C) servers to monitor the campaign. Kaspersky Lab and Seculert identified more than 800 victims located in Iran, Israel and select countries across the globe connecting to the C&Cs over the past eight months. Statistics from the sinkhole revealed that the victims were primarily business people working on Iranian and Israeli critical infrastructure projects, Israeli financial institutions, Middle Eastern engineering students, and various government agencies communicating in the Middle East.\nCommon applications and websites that were spied on include accounts on Gmail, Hotmail, Yahoo! Mail, ICQ, Skype, Google+, and Facebook. Surveillance is also performed over integrated ERP/CRM systems, business contracts, and financial management systems.",
       "link":"https://securelist.com/the-madi-campaign-part-i-5/33693/",
       "targets":[
          "Iran",
          "Pakistan",
          "Israel",
          "United States"
       ],
       "name":"Madi"
    },
    {
       "motivation":"espionage",
       "attribution":"North Korea",
       "description":"This threat actor targets South Korean think tanks, industry, nuclear power operators, and the Ministry of Unification for espionage purposes.",
       "synonyms":[
          "Kimsuky",
          "Velvet Chollima"
       ],
       "link":"https://securelist.com/the-kimsuky-operation-a-north-korean-apt/57915/",
       "targets":[
          "Ministry of Unification",
          "Sejong Institute",
          "Korea Institute for Defense Analyses"
       ],
       "name":"Kimsuki"
    },
    {
       "motivation":"espionage",
       "attribution":"Spain",
       "description":"This threat actor targets governments, diplomatic missions, private companies in the energy sector, and academics for espionage purposes.\nThe Mask is an advanced threat actor that has been involved in cyber-espionage operations since at least 2007. The name 'Mask' comes from the Spanish slang word 'Careto' ('Ugly Face' or “Mask”) which the authors included in some of the malware modules.\n More than 380 unique victims in 31 countries have been observed to date.What makes “The Mask” special is the complexity of the toolset used by the attackers. This includes an extremely sophisticated malware, a rootkit, a bootkit, 32-and 64-bit Windows versions, Mac OS X and Linux versions and possibly versions for Android and iPad/iPhone (Apple iOS).",
       "synonyms":[
          "The Mask",
          "Mask",
          "Ugly Face"
       ],
       "link":"https://securelist.com/the-caretomask-apt-frequently-asked-questions/58254/",
       "targets":[
          "Morocco",
          "France",
          "Libya",
          "Venezuela",
          "Poland",
          "Brazil",
          "Spain",
          "United States",
          "South Africa",
          "Tunisia",
          "United Kingdom",
          "Switzerland",
          "Iran",
          "Germany"
       ],
       "name":"Careto"
    },
    {
       "motivation":"espionage",
       "attribution":"North Korea",
       "description":"This threat actor targets the South Korean government, transportation, and energy sectors.",
       "link":"http://news.softpedia.com/news/korean-energy-and-transportation-targets-attacked-by-oniondog-apt-501534.shtml",
       "targets":[
          "South Korea"
       ],
       "name":"OnionDog"
    },
    {
       "link":"https://www.arbornetworks.com/blog/asert/wp-content/uploads/2016/01/ASERT-Threat-Intelligence-Brief-2015-08-Uncovering-the-Seven-Pointed-Dagger.pdf",
       "attribution":"China",
       "description":"Arbor’s ASERT team is now reporting that, after looking deeper at that particular campaign, and by exposing a new trail in the group’s activities, they managed to identify a new RAT that was undetectable at that time by most antivirus vendors.\nNamed Trochilus, this new RAT was part of Group 27’s malware portfolio that included six other malware strains, all served together or in different combinations, based on the data that needed to be stolen from each victim.\nThis collection of malware, dubbed the Seven Pointed Dagger by ASERT experts, included two different PlugX versions, two different Trochilus RAT versions, one version of the 3012 variant of the 9002 RAT, one EvilGrab RAT version, and one unknown piece of malware, which the team has not entirely decloaked just yet.",
       "name":"Group 27"
    },
    {
       "attribution":"China",
       "description":"The FBI issued a rare bulletin admitting that a group named Advanced Persistent Threat 6 (APT6) hacked into US government computer systems as far back as 2011 and for years stole sensitive data.\nThe FBI alert was issued in February and went largely unnoticed. Nearly a month later, security experts are now shining a bright light on the alert and the mysterious group behind the attack.\n“This is a rare alert and a little late, but one that is welcomed by all security vendors as it offers a chance to mitigate their customers and also collaborate further in what appears to be an ongoing FBI investigation,” said Deepen Desai, director of security research at the security firm Zscaler in an email to Threatpost.\nDetails regarding the actual attack and what government systems were infected are scant. Government officials said they knew the initial attack occurred in 2011, but are unaware of who specifically is behind the attacks.\n“Given the nature of malware payload involved and the duration of this compromise being unnoticed – the scope of lateral movement inside the compromised network is very high possibly exposing all the critical systems,”Deepen said.",
       "synonyms":[
          "1.php Group",
          "APT6"
       ],
       "link":"https://threatpost.com/fbi-quietly-admits-to-multi-year-apt-attack-sensitive-data-stolen/117267/",
       "name":"APT 6"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"As a part of our Kaspersky APT Intelligence Reporting subscription, customers received an update in mid-February 2017 on some interesting APT activity that we called WhiteBear. Much of the contents of that report are reproduced here. WhiteBear is a parallel project or second stage of the Skipper Turla cluster of activity documented in another private intelligence report “Skipper Turla – the White Atlas framework” from mid-2016. Like previous Turla activity, WhiteBear leverages compromised websites and hijacked satellite connections for command and control (C2) infrastructure. As a matter of fact, WhiteBear infrastructure has overlap with other Turla campaigns, like those deploying Kopiluwak, as documented in “KopiLuwak – A New JavaScript Payload from Turla” in December 2016. WhiteBear infected systems maintained a dropper (which was typically signed) as well as a complex malicious platform which was always preceded by WhiteAtlas module deployment attempts. However, despite the similarities to previous Turla campaigns, we believe that WhiteBear is a distinct project with a separate focus. We note that this observation of delineated target focus, tooling, and project context is an interesting one that also can be repeated across broadly labeled Turla and Sofacy activity.\nFrom February to September 2016, WhiteBear activity was narrowly focused on embassies and consular operations around the world. All of these early WhiteBear targets were related to embassies and diplomatic/foreign affair organizations. Continued WhiteBear activity later shifted to include defense-related organizations into June 2017. When compared to WhiteAtlas infections, WhiteBear deployments are relatively rare and represent a departure from the broader Skipper Turla target set. Additionally, a comparison of the WhiteAtlas framework to WhiteBear components indicates that the malware is the product of separate development efforts. WhiteBear infections appear to be preceded by a condensed spearphishing dropper, lack Firefox extension installer payloads, and contain several new components signed with a new code signing digital certificate, unlike WhiteAtlas incidents and modules.",
       "synonyms":[
          "Skipper Turla"
       ],
       "link":"https://securelist.com/introducing-whitebear/81638/",
       "targets":[
          "United States",
          "South Korea",
          "United Kingdom",
          "Uzbekistan"
       ],
       "name":"White Bear"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"The MuddyWater attacks are primarily against Middle Eastern nations. However, we have also observed attacks against surrounding nations and beyond, including targets in India and the USA. MuddyWater attacks are characterized by the use of a slowly evolving PowerShell-based first stage backdoor we call “POWERSTATS”. Despite broad scrutiny and reports on MuddyWater attacks, the activity continues with only incremental changes to the tools and techniques.",
       "synonyms":[
          "TEMP.Zagros",
          "Static Kitten",
          "Seedworm"
       ],
       "link":"https://attack.mitre.org/groups/G0069/",
       "targets":[
          "Saudi Arabia",
          "Georgia",
          "Turkey",
          "Iraq",
          "Israel",
          "India",
          "United Arab Emirates",
          "Pakistan",
          "United States"
       ],
       "name":"MuddyWater"
    },
    {
       "link":"https://attack.mitre.org/groups/G0070/",
       "attribution":"Lebanon",
       "description":"Lookout and Electronic Frontier Foundation (EFF) have discovered Dark Caracal, a persistent and prolific actor, who at the time of writing is believed to be administered out of a building belonging to the Lebanese General Security Directorate in Beirut. At present, we have knowledge of hundreds of gigabytes of exfiltrated data, in 21+ countries, across thousands of victims. Stolen data includes enterprise intellectual property and personally identifiable information.",
       "name":"Dark Caracal"
    },
    {
       "attribution":"North Korea",
       "description":"APT37 has likely been active since at least 2012 and focuses on targeting the public and private sectors primarily in South Korea. In 2017, APT37 expanded its targeting beyond the Korean peninsula to include Japan, Vietnam and the Middle East, and to a wider range of industry verticals, including chemicals, electronics, manufacturing, aerospace, automotive and healthcare entities",
       "synonyms":[
          "APT 37",
          "Group 123",
          "Group123",
          "Starcruft",
          "Reaper",
          "Reaper Group",
          "Red Eyes",
          "Ricochet Chollima",
          "StarCruft",
          "Operation Daybreak",
          "Operation Erebus",
          "Venus 121"
       ],
       "link":"https://attack.mitre.org/groups/G0067/",
       "targets":[
          "Republic of Korea",
          "Japan",
          "Vietnam"
       ],
       "name":"APT37"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"Leviathan is an espionage actor targeting organizations and high-value targets in defense and government. Active since at least 2014, this actor has long-standing interest in maritime industries, naval defense contractors, and associated research institutions in the United States and Western Europe.",
       "synonyms":[
          "TEMP.Periscope",
          "TEMP.Jumper",
          "APT 40",
          "APT40",
          "BRONZE MOHAWK",
          "GADOLINIUM"
       ],
       "link":"https://attack.mitre.org/groups/G0065/",
       "targets":[
          "United States",
          "Hong Kong",
          "The Philippines",
          "Asia Pacific Economic Cooperation"
       ],
       "name":"Leviathan"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Since at least 2014, an Iranian threat group tracked by FireEye as APT34 has conducted reconnaissance aligned with the strategic interests of Iran. The group conducts operations primarily in the Middle East, targeting financial, government, energy, chemical, telecommunications and other industries. Repeated targeting of Middle Eastern financial, energy and government organizations leads FireEye to assess that those sectors are a primary concern of APT34. The use of infrastructure tied to Iranian operations, timing and alignment with the national interests of Iran also lead FireEye to assess that APT34 acts on behalf of the Iranian government.",
       "synonyms":[
          "APT 34"
       ],
       "link":"https://www.fireeye.com/content/dam/collateral/en/mtrends-2018.pdf",
       "targets":[
          "Middle East"
       ],
       "name":"APT34"
    },
    {
       "attribution":"Iran",
       "description":"FireEye has identified APT35 operations dating back to 2014. APT35, also known as the Newscaster Team, is a threat group sponsored by the Iranian government that conducts long term, resource-intensive operations to collect strategic intelligence. APT35 typically targets U.S. and the Middle Eastern military, diplomatic and government personnel, organizations in the media, energy and defense industrial base (DIB), and engineering, business services and telecommunications sectors.",
       "synonyms":[
          "APT 35",
          "Newscaster Team"
       ],
       "link":"https://www.fireeye.com/content/dam/collateral/en/mtrends-2018.pdf",
       "name":"APT35"
    },
    {
       "motivation":"espionage",
       "attribution":"Iran",
       "description":"Adversaries abusing ICS (based on Dragos Inc adversary list).",
       "synonyms":[
          "APT33"
       ],
       "link":"https://dragos.com/adversaries.html",
       "targets":[
          "United States",
          "Saudi Arabia",
          "South Korea"
       ],
       "name":"MAGNALLIUM"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"The Rancor group’s attacks use two primary malware families which are naming DDKONG and PLAINTEE. DDKONG is used throughout the campaign and PLAINTEE appears to be new addition to these attackers’ toolkit.  Countries Unit 42 has identified as targeted by Rancor with these malware families include, but are not limited to Singapore and Cambodia.",
       "synonyms":[
          "Rancor group",
          "Rancor",
          "Rancor Group"
       ],
       "link":"https://attack.mitre.org/groups/G0075/",
       "targets":[
          "Singapore",
          "Cambodia"
       ],
       "name":"RANCOR"
    },
    {
       "link":"https://www.cfr.org/interactive/cyber-operations/temptick",
       "attribution":"China",
       "description":"This threat actor targets organizations in the finance, defense, aerospace, technology, health-care, and automotive sectors and media organizations in East Asia for the purpose of espionage. Believed to be responsible for the targeting of South Korean actors prior to the meeting of Donald J. Trump and Kim Jong-un",
       "name":"TempTick",
       "targets":[
          "South Korea",
          "Japan"
       ]
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor targets software companies and political organizations in the United States, China, Japan, and South Korea. It primarily acts to support cyber operations conducted by other threat actors affiliated with Chinese intelligence services.\nBelieved to be associated with the Axiom, APT 17, and Mirage threat actors. Believed to share the same tools and infrastructure as the threat actors that carried out Operation Aurora, the 2015 targeting of video game companies, the 2015 targeting of the Thai government, and the 2017 targeting of Chinese-language news websites",
       "link":"https://www.cfr.org/interactive/cyber-operations/winnti-umbrella",
       "targets":[
          "United States",
          "South Korea",
          "United Kingdom",
          "China",
          "Japan"
       ],
       "name":"Winnti Umbrella"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor targets Uighurs—a minority ethnic group located primarily in northwestern China—and devices from Chinese mobile phone manufacturer Xiaomi, for espionage purposes.",
       "link":"https://www.cfr.org/interactive/cyber-operations/henbox",
       "targets":[
          "Uighurs"
       ],
       "name":"HenBox"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor targets nongovernmental organizations using Mongolian-themed lures for espionage purposes.\nIn April 2017, CrowdStrike Falcon Intelligence observed a previously unattributed actor group with a Chinese nexus targeting a U.S.-based think tank. Further analysis revealed a wider campaign with unique tactics, techniques, and procedures (TTPs). This adversary targets non-governmental organizations (NGOs) in general, but uses Mongolian language decoys and themes, suggesting this actor has a specific focus on gathering intelligence on Mongolia. These campaigns involve the use of shared malware like Poison Ivy or PlugX.\nRecently, Falcon Intelligence observed new activity from MUSTANG PANDA, using a unique infection chain to target likely Mongolia-based victims. This newly observed activity uses a series of redirections and fileless, malicious implementations of legitimate tools to gain access to the targeted systems. Additionally, MUSTANG PANDA actors reused previously-observed legitimate domains to host files.",
       "link":"https://www.cfr.org/interactive/cyber-operations/mustang-panda",
       "targets":[
          "United States"
       ],
       "name":"Mustang Panda"
    },
    {
       "motivation":"espionage",
       "attribution":"Pakistan",
       "description":"This threat actor targets organizations in the satellite communications, telecommunications, geospatial-imaging, and defense sectors in the United States and Southeast Asia for espionage purposes.",
       "link":"https://www.cfr.org/interactive/cyber-operations/stealth-mango-and-tangelo",
       "targets":[
          "Pakistan",
          "Iraq",
          "Australia",
          "Afghanistan",
          "United Arab Emirates",
          "Germany",
          "India",
          "United States"
       ],
       "name":" Stealth Mango and Tangelo "
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"This threat actor targets critical infrastructure entities in the oil and gas sector, primarily in Ukraine. The threat actors deploy the BugDrop malware to remotely access the microphones in their targets' computers to eavesdrop on conversations.",
       "link":"https://www.cfr.org/interactive/cyber-operations/operation-bugdrop",
       "targets":[
          "Ukraine",
          "Austria",
          "Russia",
          "Saudi Arabia"
       ],
       "name":"Operation BugDrop"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"This threat actor targets governments, diplomatic missions, academics, and energy and aerospace organizations for the purpose of espionage. Also known as the Rocra and believed to be the same threat actor as Cloud Atlas",
       "synonyms":[
          "the Rocra"
       ],
       "link":"https://www.cfr.org/interactive/cyber-operations/red-october",
       "targets":[
          "Russia",
          "Belgium",
          "Armenia",
          "Ukraine",
          "Belarus",
          "Kazakhstan",
          "India",
          "Iran",
          "United States",
          "Greece",
          "Azerbaijan",
          "Afghanistan",
          "Turkmenistan",
          "Vietnam",
          "Italy"
       ],
       "name":"Red October"
    },
    {
       "motivation":"espionage",
       "attribution":"Russia",
       "description":"This threat actor targets governments and diplomatic organizations for espionage purposes.",
       "link":"https://www.cfr.org/interactive/cyber-operations/cloud-atlas",
       "targets":[
          "Russia",
          "India",
          "Kazakhstan",
          "Czech Republic",
          "Belarus"
       ],
       "name":"Cloud Atlas"
    },
    {
       "motivation":"espionage",
       "attribution":"China",
       "description":"This threat actor compromises civil society groups the Chinese Communist Party views as hostile to its interests, such as Tibetan, Uyghur, Hong Kong, and Taiwanese activist. The threat actor also targeted the Myanmar electoral commission. ",
       "link":"https://www.cfr.org/interactive/cyber-operations/unnamed-actor",
       "targets":[
          "China",
          "Myanmar",
          "Hong Kong",
          "Taiwan"
       ],
       "name":"Unnamed Actor"
    },
    {
       "link":"https://resecurity.com/blog/parliament_races/",
       "attribution":"Iran",
       "description":"Resecurity’s research indicates that the attack on Parliament is a part of a multi-year cyberespionage campaign orchestrated by a nation-state actor whom we are calling IRIDIUM. This actor targets sensitive government, diplomatic, and military resources in the countries comprising the Five Eyes intelligence alliance (which includes Australia, Canada, New Zealand, the United Kingdom and the United States)",
       "name":"IRIDIUM"
    },
    {
       "attribution":"China",
       "description":"FireEye characterizes APT31 as an actor specialized on intellectual property theft, focusing on data and projects that make a particular organization competetive in its field. Based on available data (April 2016), FireEye assesses that APT31 conducts network operations at the behest of the Chinese Government.",
       "synonyms":[
          "APT 31",
          "ZIRCONIUM"
       ],
       "link":"https://www.microsoft.com/security/blog/2017/03/27/detecting-and-mitigating-elevation-of-privilege-exploit-for-cve-2017-0005/",
       "name":"APT31"
    },
    {
       "link":"https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology",
       "attribution":"China",
       "description":"Proofpoint researchers have identified a targeted APT campaign that utilized malicious RTF documents to deliver custom malware to unsuspecting victims. We dubbed this campaign “Operation LagTime IT” based on entities that were targeted and the distinctive domains registered to C&C IP infrastructure. Beginning in early 2019, these threat actors targeted a number of government agencies in East Asia overseeing government information technology, domestic affairs, foreign affairs, economic development, and political processes. We determined that the infection vector observed in this campaign was spear phishing, with emails originating from both free email accounts and compromised user accounts. Attackers relied on Microsoft Equation Editor exploit CVE-2018-0798 to deliver a custom malware that Proofpoint researchers have dubbed Cotx RAT. Additionally, this APT group utilizes Poison Ivy payloads that share overlapping command and control (C&C) infrastructure with the newly identified Cotx campaigns. Based on infrastructure overlaps, post-exploitation techniques, and historic TTPs utilized in this operation, Proofpoint analysts attribute this activity to the Chinese APT group tracked internally as TA428. Researchers believe that this activity has an operational and tactical resemblance to the Maudi Surveillance Operation which was previously reported in 2013.",
       "name":"TA428"
    },
    {
       "link":"https://www.fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html",
       "attribution":"China",
       "description":"APT41 is a prolific cyber threat group that carries out Chinese state-sponsored espionage activity in addition to financially motivated activity potentially outside of state control.",
       "name":"APT41",
       "targets":[
          "France",
          "India",
          "Italy",
          "Japan",
          "Myanmar",
          "Netherlands",
          "Singapore",
          "South Korea",
          "South Africa",
          "Switzerland",
          "Thailand",
          "Turkey",
          "United Kingdom",
          "United States"
       ]
    },
    {
       "attribution":"China",
       "description":"Based on the evidence we have presented Symantec attributed the activity involving theDripion malware to the Budminer advanced threat group. While we have not seen newcampaigns using Taidoor malware since 2014, we believe the Budminer group has changedtactics to avoid detection after being outed publicly in security white papers and blogs over thepast few years.",
       "synonyms":[
          "Budminer cyberespionage group"
       ],
       "link":"https://www.symantec.com/connect/blogs/taiwan-targeted-new-cyberespionage-back-door-trojan",
       "name":"Budminer"
    }
 ]